In [2]:
import pandas as pd

In [7]:
item_cols = ['movie_id','title']+[str(i) for i in range(22)]

In [9]:
cols =['user_id','movie_id','rating','ts']

In [10]:
df = pd.read_csv('u.data',sep='\t',names=cols)

In [11]:
df

        user_id  movie_id  rating         ts
0             0        50       5  881250949
1             0       172       5  881250949
2             0       133       1  881250949
3           196       242       3  881250949
4           186       302       3  891717742
...         ...       ...     ...        ...
99998       880       476       3  880175444
99999       716       204       5  879795543
100000      276      1090       1  874795795
100001       13       225       2  882399156
100002       12       203       3  879959583

[100003 rows x 4 columns]

In [14]:
df1 = pd.read_csv('u.item',sep='|',names = item_cols,encoding = "ISO-8859-1")[['movie_id','title']]

In [15]:
 df1

      movie_id                                      title
0            1                           Toy Story (1995)
1            2                           GoldenEye (1995)
2            3                          Four Rooms (1995)
3            4                          Get Shorty (1995)
4            5                             Copycat (1995)
...        ...                                        ...
1677      1678                          Mat' i syn (1997)
1678      1679                           B. Monkey (1998)
1679      1680                       Sliding Doors (1998)
1680      1681                        You So Crazy (1994)
1681      1682  Scream of Stone (Schrei aus Stein) (1991)

[1682 rows x 2 columns]

In [18]:
rating.sort_values(by ='count',ascending = False).head(10)

NameError: name 'rating' is not defined

In [17]:
movie_pivot = movie.pivot_table(index = 'user_id',columns = 'title',values = 'rating')movie_pivot.head()

SyntaxError: invalid syntax (828418769.py, line 1)